// SPDX-License-Identifier: AGPL-3.0-or-later
#include <game_psp.h>

// https://pspdev.github.io/pspsdk/
#define PSP_LEGACY_TYPES_DEFINED // avoid processing psptypes.h
#include <pspctrl.h>
#include <pspgu.h>
#include <pspthreadman.h>
#include <psputility_modules.h>
#include <psputility_sysparam.h>

typedef enum {
    SCREEN_MODE_ZERO,
    SCREEN_MODE_ONE,
} ScreenMode;

typedef struct {
    s32 unk0;
    s32 unk4;
    s32 unk8;
    s32 unkC;
    s32* unk10;
} Unk08919CF4;

typedef struct {
    s32 unk0;
    s32 unk4;
    s32 unk8;
} Unk08919D98;

typedef struct {
    s32 x;
    s32 y;
} Unk08C4218C;

typedef struct {
    s32 unk0;
    float unk4;
    float unk8;
    float unkC;
} Unk0891B118;

typedef struct {
    s32 : 32;
    s32 : 32;
    s32 : 32;
    float unkC;
    float unk10;
    s32 : 32;
} Unk0891D9F4;

#define O_TAG                                                                  \
    u_long tag;                                                                \
    u_long len

typedef struct {
    /* 0x00 */ O_TAG;
    /* 0x04 */ u_char r0;
    /* 0x05 */ u_char g0;
    /* 0x06 */ u_char b0;
    /* 0x07 */ u_char code;
    /* 0x08 */ short x0;
    /* 0x0A */ short y0;
    /* 0x0C */ u_char r1;
    /* 0x0D */ u_char g1;
    /* 0x0E */ u_char b1;
    /* 0x0F */ u_char pad1;
    /* 0x10 */ short x1;
    /* 0x12 */ short y1;
    /* 0x14 */ u_char r2;
    /* 0x15 */ u_char g2;
    /* 0x16 */ u_char b2;
    /* 0x17 */ u_char pad2;
    /* 0x18 */ short x2;
    /* 0x1A */ short y2;
    /* 0x1C */ u_char r3;
    /* 0x1D */ u_char g3;
    /* 0x1E */ u_char b3;
    /* 0x1F */ u_char pad3;
    /* 0x20 */ short x3;
    /* 0x22 */ short y3;
} POLY_G4; /* Gouraud Quadrangle, size = 0x24 */

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
    short x1, y1;
} LINE_F2;

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
    u_char r1, g1, b1, p1;
    short x1, y1;
} LINE_G2;

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
    short x1, y1;
    short x2, y2;
    short x3, y3;
    u_long pad;
} LINE_F4;

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
    u_char r1, g1, b1, p1;
    short x1, y1;
    u_char r2, g2, b2, p2;
    short x2, y2;
    u_char r3, g3, b3, p3;
    short x3, y3;
    u_long pad;
} LINE_G4;

typedef struct {
    O_TAG;
    u_char r0, g0, b0, code;
    short x0, y0;
    short w, h;
} TILE;

typedef struct {
    short x, y, w, h;
} RECT;

extern s32 D_psp_0893CED0;
extern s32 D_psp_0893CF74[];
extern char D_psp_08946410[];
extern s32 D_psp_08946424;
extern s32 D_psp_08946430;
