#include "servant.h"

Sprite D_80170608[] = {
    {-4, -4, 8, 8, 0x144, 0x78, 8, 0, 0, 0, 16, 0, 8, 0},
    {-4, -4, 8, 8, 0x144, 0x78, 120, 0, 8, 0, 128, 0, 16, 0},
    {-4, -4, 8, 8, 0x144, 0x78, 228, 0, 135, 0, 236, 0, 143, 0},
    {-4, -4, 8, 8, 0x144, 0x78, 80, 0, 0, 0, 88, 0, 8, 0},
};
s32 D_80170658[][5] = {
    {90, 64, 0, 128, 1}, //
    {90, 96, 0, 128, 1}, //
    {60, 128, 1, 96, 1}, //
    {60, 160, 1, 96, 0}, //
    {60, 192, 2, 64, 0}, //
    {60, 224, 2, 64, 0}, //
    {45, 256, 2, 32, 0}, //
    {45, 288, 3, 32, 0}, //
    {30, 320, 3, 16, 0}, //
    {30, 352, 3, 16, 0}, //
};

u16 D_80170720[] = {
    0x0000, 0xFC00, 0xF400, 0xEC00, 0xE400, 0xDC00, 0xD400, 0xCC00,
    0xC400, 0xBC00, 0xB400, 0xAC00, 0xA400, 0x9C00, 0x9400, 0x8C00,
    0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x7FFF, 0x0000,
    0x0000, 0x000C, 0x0C76, 0x14BF, 0x295F, 0x39FF, 0x463F, 0x7BDE,
};

typedef struct {
    /* 0x00 */ u32 unk0;
    /* 0x04 */ u32 unk4;
    /* 0x08 */ u32 unk8;
    /* 0x0C */ s32 unkC;
    /* 0x10 */ u32 unk10;
    /* 0x14 */ u32 cameraX;
    /* 0x18 */ u32 cameraY;
    /* 0x1C */ s32 unk1C;
    /* 0x20 */ u32 unk20;
    /* 0x24 */ u32 entityId;
    /* 0x28 */ u32 params;
    /* 0x2C */ u32 unk2C;
} Unkstruct_80174210;

u32 D_80170760[] = {
    /**/ 0, 0, -1, -1,  -1,   -1,    -1,    -1,         -1,    -1,  0,  0,
    /**/ 0, 0, 1,  41,  50,   0,     4,     0x80000042, 1,     223, 15, 1,
    /**/ 0, 0, 2,  41,  50,   0,     4,     0x80000042, 1,     223, 15, 1,
    /**/ 0, 0, 4,  49,  0x14, 0,     4,     -1,         0,     223, 0,  1,
    /**/ 0, 0, 4,  32,  0x28, 0,     4,     0x80000050, 8,     223, 1,  1,
    /**/ 0, 0, 4,  16,  21,   0,     4,     -1,         0,     223, 0,  1,
    /**/ 0, 0, 4,  -31, 0x14, 0,     0x304, 0x80000058, 8,     223, 1,  1,
    /**/ 0, 0, 4,  41,  50,   0,     4,     0x80000042, 1,     223, 15, 1,
    /**/ 0, 0, 7,  49,  0x14, 0,     4,     -1,         0,     223, 0,  1,
    /**/ 0, 0, 7,  32,  0x28, 0,     4,     0x80000050, 8,     223, 1,  1,
    /**/ 0, 0, 7,  16,  21,   0,     4,     -1,         0,     223, 0,  1,
    /**/ 0, 0, 7,  -31, 0x14, 0,     0x304, 0x80000058, 8,     223, 1,  1,
    /**/ 0, 0, 7,  41,  50,   0,     4,     0x80000042, 1,     223, 15, 1,
    /**/ 0, 0, 3,  49,  0x14, 0,     4,     -1,         0,     220, 0,  1,
    /**/ 0, 0, 3,  16,  21,   0,     4,     -1,         0,     220, 0,  1,
    /**/ 0, 0, 3,  41,  50,   0,     4,     0x80000042, 0x30,  220, 1,  1,
    /**/ 0, 0, 3,  21,  0x16, 0x96,  4,     0x40000007, 0x60,  220, 2,  1,
    /**/ 0, 0, 3,  60,  0x1A, 0,     0xFF,  0x40000007, 0x60,  220, 2,  1,
    /**/ 0, 0, 3,  44,  18,   0x279, 0x304, 0x40000007, 0x60,  220, 2,  1,
    /**/ 0, 0, 3,  10,  15,   496,   4,     0x40000007, 0x60,  220, 2,  1,
    /**/ 0, 0, 3,  39,  37,   0,     0x204, 0x800000C4, 0x60,  220, 3,  1,
    /**/ 0, 0, 3,  36,  27,   0,     4,     0x800000C6, 0x100, 220, 4,  1,
    /**/ 0, 0, 3,  12,  32,   0,     0x204, 0x80000081, 0xA0,  220, 5,  1,
    /**/ 0, 0, 3,  12,  32,   0,     0x1FF, 0x80000082, 32,    220, 6,  1,
    /**/ 0, 0, 3,  27,  21,   0x200, 0x104, 0x80000020, 0x40,  220, 7,  1,
    /**/ 0, 0, 3,  49,  18,   0,     4,     0x80000070, 0x200, 220, 8,  1,
    /**/ 0, 0, 3,  50,  11,   0,     4,     0x800000A2, 32,    220, 9,  1,
    /**/ 0, 0, 3,  43,  10,   0,     0xFF,  0x800000A1, 0x80,  220, 10, 1,
    /**/ 0, 0, 3,  41,  50,   0,     4,     0x80000042, 1,     220, 15, 1,
    /**/ 0, 0, 6,  49,  0x14, 0,     4,     -1,         0,     220, 0,  1,
    /**/ 0, 0, 6,  16,  21,   0,     4,     -1,         0,     220, 0,  1,
    /**/ 0, 0, 6,  41,  50,   0,     4,     0x80000042, 0x30,  220, 1,  1,
    /**/ 0, 0, 6,  21,  0x16, 0x96,  4,     0x40000007, 0x60,  220, 2,  1,
    /**/ 0, 0, 6,  60,  0x1A, 0,     0xFF,  0x40000007, 0x60,  220, 2,  1,
    /**/ 0, 0, 6,  44,  18,   0x279, 0x304, 0x40000007, 0x60,  220, 2,  1,
    /**/ 0, 0, 6,  10,  15,   496,   4,     0x40000007, 0x60,  220, 2,  1,
    /**/ 0, 0, 6,  39,  37,   0,     0x204, 0x800000C4, 0x60,  220, 3,  1,
    /**/ 0, 0, 6,  36,  27,   0,     4,     0x800000C6, 0x100, 220, 4,  1,
    /**/ 0, 0, 6,  12,  32,   0,     0x204, 0x80000081, 0xA0,  220, 5,  1,
    /**/ 0, 0, 6,  12,  32,   0,     0x1FF, 0x80000082, 32,    220, 6,  1,
    /**/ 0, 0, 6,  27,  21,   0x200, 0x104, 0x80000020, 0x40,  220, 7,  1,
    /**/ 0, 0, 6,  49,  18,   0,     4,     0x80000070, 0x200, 220, 8,  1,
    /**/ 0, 0, 6,  50,  11,   0,     4,     0x800000A2, 32,    220, 9,  1,
    /**/ 0, 0, 6,  43,  10,   0,     0xFF,  0x800000A1, 0x80,  220, 10, 1,
    /**/ 0, 0, 6,  41,  50,   0,     4,     0x80000042, 1,     220, 15, 1,
    /**/ 0, 0, 5,  49,  0x14, 0,     4,     -1,         0,     220, 0,  1,
    /**/ 0, 0, 5,  16,  21,   0,     4,     -1,         0,     220, 0,  1,
    /**/ 0, 0, 5,  41,  50,   0,     4,     0x80000042, 1,     220, 15, 1,
    /**/ 0, 0, -1, -1,  -1,   -1,    -1,    -1,         -1,    -1,  0,  0,
};

s32 D_80171090 = 99;
EntitySearch D_80171094[] = {{5, 7}, {32, 63}};
u32* D_8017109C = D_80170760;
u32 D_801710A0 = 0;
u32 D_801710A4 = 0;
u32 D_801710A8 = 0;
