// SPDX-License-Identifier: AGPL-3.0-or-later
#include "sattypes.h"

char* DAT_0607C0F0[] = {
    "本体ＲＡＭ",
    "カートリッジＲＡＭ",
};

char* DAT_0607C0F8[] = {
    "はい",
    "いいえ",
};

char* DAT_0607C100 = "バックアップＲＡＭを\x01選んで下さい。";

char* DAT_0607C104 = "の全ての記録を";

char* DAT_0607C108 = "消します。（初期化します）\x01　　　　よろしいですか？";

char* DAT_0607C10C = "　　　記録の更新をしますか？";

char* DAT_0607C110 = "　　　　セーブしますか？";

char* DAT_0607C114 = "セーブしました。";

char* DAT_0607C118 = "　データが５つ全てセーブされて　\x01　います。";

char* DAT_0607C11C = "の全ての記録を";

char* DAT_0607C120 =
    "消すことができませんでした。\x01（初期化できませんでした）";

char* DAT_0607C124 = "のバックアップ";

char* DAT_0607C128 = "の準備がまだできていません。\x01（初期化されていません）";

char* DAT_0607C12C =
    "このゲームの記録をセーブするため\x01には７０の空き容量が必要です。";

char* DAT_0607C130 = "記録を正しくセーブすることができ\x01ませんでした。";

u16 DAT_0607C134[][2] = {
    {0x64, 0x78},
    {0x2C, 0x6C},
    {0xA8, 0x6C},
};

u16 DAT_0607C140[][2] = {
    {0x40, 0xC0},
    {0x5C, 0x24},
    {0xC0, 0x24},
};
